bubblyDPMFoam/testBuoyant/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101.325;

boundaryField
{
    
    inlet
    {
        type            fixedFluxPressure;
        phi             phi.water;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        phi             phi.water;
        value           $internalField;
    }

    frontAndBack
    {
       
   	type            empty;
    }
}

// ************************************************************************* //
