bubblyDPMFoam/testBuoyant/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
grid  			100;
yMax			0;
yMin			-20;
xMax			1;
xMin			0;
z       		1;

vertices
(
    ($xMin $yMin 0)
    ($xMax $yMin 0)
    ($xMax $yMax 0)
    ($xMin $yMax 0)
    ($xMin $yMin $z)
    ($xMax $yMin $z)
    ($xMax $yMax $z)
    ($xMin $yMax $z)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 $grid 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	inlet
	{ 
		type patch;    
		faces 
		( 
			(1 5 4 0)
		); 
	}                  
	
	outlet
	{ 
		type patch;    
		faces 
		( 
			(3 7 6 2)
		); 
	} 

    frontAndBack
    {
        type empty;
        faces
        (
			(0 3 2 1)  
			(4 5 6 7)
			(0 4 7 3)
			(2 6 5 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
