bubblyDPMFoam/testBuoyant/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    //"(p|kinematicCloud:theta)"
    //{
    //    solver          GAMG;
    //    tolerance       1e-06;
    //    relTol          0.01;
    //    smoother        GaussSeidel;
    //}

    //"(p|kinematicCloud:theta)Final"
    //{
    //    solver          GAMG;
    //    tolerance       1e-06;
    //    relTol          0;
    //    smoother        GaussSeidel;
    //}
   
    "(p|pOverRho|kinematicCloud:theta)"
    {
        solver          PCG;
		preconditioner	DIC;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(p|pOverRho|kinematicCloud:theta)Final"
    {
    	solver          PCG;
		preconditioner	DIC;
        tolerance       1e-06;
        relTol          0.0;
        smoother        GaussSeidel;
    }
    "(U.water|k.water|epsilon.water)"
    {
        solver          PBiCGStab;
  	preconditioner	DILU;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U.water|k.water|epsilon.water)Final"
    {
        solver          PBiCGStab;
  	preconditioner	DILU;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
}


// ************************************************************************* //
